{"meta":{"title":"CVBlogs","subtitle":"CV-oriented blogging.","description":"Less sh*t posts pls.","author":"Qin Zhong","url":"https://cvblogs.cn","root":"/"},"pages":[{"title":"About","date":"2017-08-13T17:23:33.000Z","updated":"2020-08-23T16:26:18.000Z","comments":true,"path":"about/index.html","permalink":"https://cvblogs.cn/about/index.html","excerpt":"","text":"The Blog The blog hosts all the things that the maintainer(she/her) is interested in, mainly programming, reading, language learning. Note: In order to maintain a clean and professional blog, the maintainer moved most of the old posts into stash in 2020/08/23 and guaranteed no more 💩 posts since then. The Maintainer She is an enthusiastic sharer who likes to share those useful and helpful contents to others. Her Motto Talent you have naturally.Skill is only developed by hours and hours and hours of beating on your craft.Just decide what is gonna be, who you’re gonna be and how you’re gonna do it.Will Smith — Will Smith’s Most Inspiring Quotes On Life Contacts Feel free to send her an Email if you have any doubts about the posts. You can also find her on GitHub, Goodreads, Duolingo. The Trap"},{"title":"Categories","date":"2017-08-13T17:19:54.000Z","updated":"2017-08-13T17:19:54.000Z","comments":false,"path":"categories/index.html","permalink":"https://cvblogs.cn/categories/index.html","excerpt":"","text":""},{"title":"Tags","date":"2017-08-13T17:16:20.000Z","updated":"2017-08-13T17:16:20.000Z","comments":false,"path":"tags/index.html","permalink":"https://cvblogs.cn/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Hash in Action","slug":"programming/hash-in-action","date":"2020-10-06T22:48:57.000Z","updated":"2020-10-06T22:48:57.000Z","comments":true,"path":"programming/hash-in-action/","link":"","permalink":"https://cvblogs.cn/programming/hash-in-action/","excerpt":"IntroIn the past three months, I was occupied by the intensive work and have no extra energy to divert my attention. But thanks to National Day! Finally, I have the time to review and to share. Vive la Chine! In this post, I share a simple use case of using hash technique in action.","text":"IntroIn the past three months, I was occupied by the intensive work and have no extra energy to divert my attention. But thanks to National Day! Finally, I have the time to review and to share. Vive la Chine! In this post, I share a simple use case of using hash technique in action. What is Hash?I have summarized Hash technique a year ago when I was preparing for on-campus recruitment season. To summarized it more simply, I draw an illustration below. Be aware that we don’t talk about how to design but how to use it in this post. In short, hash function is the core of a hash algorithm, a well-designed hash function should output different results when received high similarity inputs. With this in mind, here goes the user story. User Story As a customer manager, I want to monitor all my clients’ machines which distributed in different regions and I should receive an alert whenever, wherever and whichever server crashed, thus the OPS team who use MS-DOS will be notified promptly and the problems will be fixed quickly and I can serve my clients better. As a service leader, I don’t want your implementation to become too heavy. Just implement it simply with no user perception and without any extra expenses on it. To achieve the requirement, you may use our provided OBS which compatible in each server. System DesignSince we have different servers in different regions and each server is capable of uploading files to an OBS. The case is easier than those using telegraf or kafka things. Just as the illustration shows below, we separate the system into two parts, monitoring and notifying. MonitoringMonitor all servers by installing a cron job with a pre-defined threshold in each server to check the required metrics. If the server reaches the threshold, it will only upload the log file once to the OBS and won’t upload any more until the problem was fixed. Note that cron service needs to be restart if you edit a cron job by using crontab -e. NotifyingNotify the OPS team every time the OBS file list changed by popping a notification window, which will give enough information to fix the crashed server. This is the highlighted part I intend to share in this post, where hash technique was used by me in action. Since the OBS will receive a log file whenever a server crashed, what we need to do is to list the bucket and compare the file list to the previous one with the help of a hash algorithm. The logic behind is, if the hash value is different from each other, it means that the file list is different and there must be some new log files uploaded. Then, we need to diff and notify those new log files. Cron job in MS-DOSSince we need to retrieve the file list regularly, we need to set up a cron job to do so. Unlike *nix system, we cannot use cron services in MS-DOS. Although MS-DOS has Task Scheduler, it’s still not user-friendly if your program was implemented in shell scripts. Thus, I highly recommend you to set a cron job by using infinite loop and run the script by using nohup bash xxx.sh 2&gt;&amp;1 &amp;, which will save your time a lot. How to Notify in MS-DOSNow comes to notification, it’s easier to pop up a notification window in MS-DOS than you thought by using vb-scripts. Here is the snippet, which reads content from a file and display it on a pop up window, you may customize it to your use case. 1234set fs = creatobject(\"scripting.filesystemobject\")set ts = fs.opentextfile(\"path_to/filename.type\", 1, true)value = ts.readallMsgbox(value, 64, FormatDateTime(Now)) SummaryAlthough the whole system isn’t very complicated and is a kind of a toy-system, at least it worked without extra costs. And above all, I demonstrate a simple use case of using hash technique in action. Hope this post helped and happy coding :) Changelog 2020/10/06：First edition","categories":[{"name":"Programming","slug":"Programming","permalink":"https://cvblogs.cn/categories/Programming/"}],"tags":[{"name":"System Design","slug":"System-Design","permalink":"https://cvblogs.cn/tags/System-Design/"}]},{"title":"After Reading Lolita","slug":"reading/review-lolita-vladimir-nabokov","date":"2019-08-12T13:25:25.000Z","updated":"2019-08-14T15:02:19.000Z","comments":true,"path":"reading/review-lolita-vladimir-nabokov/","link":"","permalink":"https://cvblogs.cn/reading/review-lolita-vladimir-nabokov/","excerpt":"Intro Lolita, light of my life, fire of my loins. My sin, my soul.Lo-lee-ta: the tip of the tongue taking a trip of three steps down the palate to tap, at three, on the teeth.Lo. Lee. Ta.Vladimir Nabokov — Lolita","text":"Intro Lolita, light of my life, fire of my loins. My sin, my soul.Lo-lee-ta: the tip of the tongue taking a trip of three steps down the palate to tap, at three, on the teeth.Lo. Lee. Ta.Vladimir Nabokov — Lolita MainOn June 25th, I bought Lolita unconsciously and shelved it at the same time I knew what the novel involving. That is, not until recently I have made up my mind to read it. After reading it, which is 2 days ago, I find myself hard to appraise it. Though the words are much worth appreciating still I found myself gaining nothing from this book. Regard it as a writing guide book? Yes but no. Yes for the techniques the author used but no for they are too hard for me to master and apply at the moment. Regard it as a time-killing book? Well, that makes senses as it contains some taboo topic that seldom mentioned in public classics and it easily arouses the reader’s attention and full fill some peculiar interests. Regret for the characters’ destinies? Not at all, for me, Lo is an innate doltish evil who met two depriving monsters, one awoken its human morality in the end and killed another one. But once mourn for the death of Lo’s mother. OthersBy the way, Jeremy did a great job by interpreting it in the audio form, which relieves the disgusting backgrounds of the story and boosts the feelings transmitted from “Humbert”. Links Lolita Audio Book Changelog 2019/08/14：First edition.","categories":[{"name":"Reading","slug":"Reading","permalink":"https://cvblogs.cn/categories/Reading/"}],"tags":[{"name":"Book Review","slug":"Book-Review","permalink":"https://cvblogs.cn/tags/Book-Review/"}]},{"title":"After Reading the Elements of Style","slug":"reading/review-elements-of-style-strunk","date":"2019-06-26T10:27:36.000Z","updated":"2019-06-26T14:07:13.000Z","comments":true,"path":"reading/review-elements-of-style-strunk/","link":"","permalink":"https://cvblogs.cn/reading/review-elements-of-style-strunk/","excerpt":"Intro The most trusted writer’s guide to American English, this is the book that generations of writers have relied upon for timeless advice on grammar, diction, syntax, sentence construction, and other writing essentials.Dover Publications — Review of “The Elements of Style”","text":"Intro The most trusted writer’s guide to American English, this is the book that generations of writers have relied upon for timeless advice on grammar, diction, syntax, sentence construction, and other writing essentials.Dover Publications — Review of “The Elements of Style” MainThis is a book that you will be anxious to read it earlier. I cannot appreciate more about it. William Strunk JR. summarizes briefly but wisely the essential rules of good writing with rich explanation in plain text. It points out sharply what is bad then tells us mildly what good should be. It makes you reflect on yourselves. There are mainly 18 rules from it, each of them worths referring to over and over again. The quotation above is an excerpt I highly appreciate from the book’s review at the back cover. There are books with reviews on them that tend to exaggerate their contents. But this book is totally different; I think it is far beyond the comment. For me, it needs to be read and worths my reading again and again. And I’m trying to apply them in action. Hopefully, that will helps my writing to some extent. OthersDue to its length (almost 50 pages), I consider it as a pamphlet rather than a book. After reading it, I am a little bit of curiosity about its audiobook version. Here I attach it in the Links section. Hopefully, it will help someone who reads this post. Links Audio book from librivox.org or bilibili.com","categories":[{"name":"Reading","slug":"Reading","permalink":"https://cvblogs.cn/categories/Reading/"}],"tags":[{"name":"Book Review","slug":"Book-Review","permalink":"https://cvblogs.cn/tags/Book-Review/"}]},{"title":"After Reading Anne Lister","slug":"reading/review-anne-lister","date":"2019-06-15T18:02:15.000Z","updated":"2019-07-09T11:24:39.000Z","comments":true,"path":"reading/review-anne-lister/","link":"","permalink":"https://cvblogs.cn/reading/review-anne-lister/","excerpt":"IntroAfter I finished watching the hit HBO series Gentleman Jack, I couldn’t help myself to want to know more about Anne Lister deeply and thoroughly. During the time, I was reading the famous Wuthering Heights written by Emily Brontë, the writer who lived near Anne at the time. Apparently, it perplexed me that why Anne Lister was so different from the female characters under Emily Brontë’s and what if Emily had met Anne, will it influence her writing of Wuthering Heights? Other things that I’m interested in are the kind of geek style codebook and how does the decoding process work? And also the pleasure of peeping one’s diaries that the writer has no idea about it. Of the most importance, I want to know the history during that period since I’m a big fan of horrible histories.","text":"IntroAfter I finished watching the hit HBO series Gentleman Jack, I couldn’t help myself to want to know more about Anne Lister deeply and thoroughly. During the time, I was reading the famous Wuthering Heights written by Emily Brontë, the writer who lived near Anne at the time. Apparently, it perplexed me that why Anne Lister was so different from the female characters under Emily Brontë’s and what if Emily had met Anne, will it influence her writing of Wuthering Heights? Other things that I’m interested in are the kind of geek style codebook and how does the decoding process work? And also the pleasure of peeping one’s diaries that the writer has no idea about it. Of the most importance, I want to know the history during that period since I’m a big fan of horrible histories. PreliminaryWhat interests you?Before you start reading, you need to ask yourself, what are your interests? Is the detail of her daily routines that interests you? the diary writing technique or contents? the ‘kisses’ with her many lovers? the geek style codebook? the life after marrying Ann? You may have your own answers. Most of mine were answered by Steidele Angela in her book. Pick oneAfter a while of searching and sorting the materials. On the Resources section, I selected some useful items out of the massive materials, that I discovered on the internet, including a documentary which I think is necessary to know more about her and four recent publications about her and Anne’s life in her diaries; and some other miscellaneous that related to her. Steidele Angela “Gentleman Jack”And among four of them, I highly recommend the second one, which written by Angela Steidele, named Gentleman Jack: A biography of Anne Lister, Regency Landowner, Seducer and Secret Diarist, published in 2018. Although some of the readers in douban.com may think Angela Steidele, the author, is not pertinent enough to write about Anne and underestimate the book. But trust me, this book definitely worth 3.5/5 which I will explain later in the main section. From this book, you can find out how she progressively becomes the Anne Lister we knew. As the journalist Sue Perkins said at the end of the documentary: But if you’re looking for a luminous Regency heroine, you should tread carefully, because, for me, Anne is a much more complicated creature than that.Sue Perkins — Revealing Anne Lister And the author of the book also commented at the end of her book: First she seduced me, then she betrayed me. What I liked even more than Anne Lister’s astoundingly open way of speaking about her desire was her certainty of herself: her desire was an expression of her nature, and that was that.Steidele Angela — Gentleman Jack: A biography of Anne Lister, Regency Landowner, Seducer and Secret Diarist Helena Whitbread “The Secret Diaries Of Miss Anne Lister”I think this book is a decode version of Anne Lister’s diaries and it turns out a good example of writing a diary with a comparison of E.B. White’s One Man’s Meat. But what I am interested the most is not her routine details since I am not a good summary maker and I want someone to make a full analysis of her life from her birth to her death for me. That is why I didn’t pick up this book due to its chronological range; though it definitely worths reading. This feeling became stronger after I finished reading the one from Steidele Angela. Using the keyword search, you can easily refer to some of the details interest you the most in “The Secret Diaries Of Miss Anne Lister”. Here are the excerpts about Anne met Ann before 1832 in it. 1821 “Tuesday 12 June [Halifax] At 10¾, Miss Rawson (Catherine) &amp; Miss Crackenthorpe… called &amp; staid ½ hour, Miss Rawson to say that, as it was Whitsuntide week, her father &amp; mother did not like her to be out &amp; hoped we should excuse her coming this evening… In the afternoon, at 5¼, walked along the new road &amp; got past Pump when Miss Ann Walker of Crownest overtook me, having run herself almost out of breath. Walked with her as far as the Lidget entrance to their own grounds &amp; got home at 6.40. Made myself, as I fancied, very agreeable &amp; was particularly civil &amp; attentive in my manner. I really think the girl is flattered by it &amp; likes me. She wished me to drink tea with them. I hoped for another walk to Giles House &amp; the readiness she expressed shewed that my proposition was by no means unwelcome. She has certainly no aversion to my conversation &amp; company. After parting I could not help smiling to myself &amp; saying the flirting with this girl has done me good. It is heavy work to live without women’s society &amp; I would far rather while away an hour with this girl, who has nothing in the world to boast but good[…]” index “Cliff Hill and Crow Nest – two of the properties forming part of the Walker estate in Lightcliffe, adjacent to the Shibden estate. In 1830, Ann Walker became co-heiress, along with her sister Elizabeth, to the estate. In 1834, Ann moved into Shibden Hall to live with Anne Lister as her wife. See ‘The Walkers of Crow Nest’, in Female Fortune: Land, Gender and Authority by Jill Liddington, River Orams Press, 1988 (pp.27–38).” “Ann Walker – at this point, Anne Lister had no deep interest in her young neighbour. A decade later, however, there was a dramatic shift in Anne Lister’s attitude towards her. [See n.1.]” 1822 “Tuesday 18 June [Halifax] Dined at 5¼, and at 6¼ off in the gig to Crownest, to take a walk with Miss Ann Walker, having talked of it ever since my walk with her last year. Only her sister &amp; herself at home. They could not both leave the house &amp; Miss Ann Walker &amp; I was tête-à-tête… Very civil, etc, but she is a stupid vulgar girl. Indeed, I scarce know which of the party is the least vulgar &amp; I have no intention of taking more walks or letting the acquaintance go one jot further. I asked her to come to Shibden &amp; walk in our valley &amp; here I hope the thing will end.” SupplementaryThis section is based on Steidele Angela book. But some of them may also helpful since it relates to Anne. First thing first, reading “Prologue: Deciphering Anne Lister’s Diaries” &amp; “Epilogue: Reading Anne Lister’s writing” will give you a clear clue about the motivation of this book and how the book was arranged. And from “Timeline” combining with the content, you can easily sort out the timeline of Anne’s whole life. That will give you more concrete abstract of what will happen in this book or once happened in Anne’s life. During the reading, I also maintain a sharing google map which records most of her travel routes and I named it as “Fantastic Anne Lister: Where She Had Been“ with a reference of the movie “Fantastic Beasts and Where to Find Them”. Taking a look at it may give you some clues about where she had been in her whole life. And also with the selected items in the left panel, you can easily tell how many places she had been before she met Ann and how many places she had been with Ann. MainEmily BrontëSteidele Angela made a bold assumption in her book that Emily clearly wrote Anne and Ann into her book. This gives me a fresh reflection of Emily’s work. By the way, I also maintained a google map about them “Anne Lister &amp; Her Time“. The Brontë is at a distance of nearly 14 kilometres. Click the image and you can find more details. HistoriesReading the content written by a real existed person at the time, when you’re familiar with and interested at, is a really enjoyable experience. It will give you another viewpoint about the historical events, e.g., the repeal of the Corn Laws in 1819 and the July Revolution in 1830. Anne ListerBack to Anne, when I read the book, sometimes she makes me piss off and if I could I would tear her into pieces and shout at her in her face “You monster, jerk, villain…! You bloody hell Tory…! Look what you have done…”. But there are also many times I find out she is as lovable as ever I thought and want to wish her all well. The emotions about her are quite complex and always not settled, I think this is because I overestimated her at the very beginning that I considered her as a perfect person but soon find out the gap is a little bit of large. But just as the lines that Fantine sang in the ‘Les Miserables’ musical, “Is there anyone here. Who can swear before God. She has nothing to fear? She has nothing to hide?”. She didn’t choose to expose herself before us, it is us that choose her. As Dickens said at the beginning of his “A Tale of Two Cities”, I want to make a comment of her that she is a person of attentive, she is a person of selfish, she is a person of candid, she is a person of villainous, she may not perfect enough, she isn’t that bad - in short, she is just a person like you and me with flaws and merits but lives her life like an epic, for good or for evil, in the superlative degree of comparison only. Alas, of the most important, what can you learn from her life experiences? Her diarySince a sixth of the content of her diaries is encrypted, the first thing interests me is her codebook due to my speciality, how does the encode/decode process work? How hard could it be by using OCR techniques to decode? If you are also interested, you may refer to this thesis. But it turns out really hard for me to figure out since the calligraphy is in italic and the informal cryptography process and codebook. What does she read? Some books she read that mentioned in the biography are the classics in Greeks/France before her time but no fictions like ‘The Red and the Black’ by Stendhal that published at her time that most of them were considered as classics nowadays. And another thing that interests me is how does she maintain her body? Is that yoga or something else? To find the answer, you can refer to the google map I maintain “Anne Lister &amp; Her Time“ that she do brisk walking almost every day when she was in Halifax. Anne, however, needed her daily marches; she covered the six-mile walk from Ripponden to Halifax in two hours.Steidele Angela — Gentleman Jack: A biography of Anne Lister, Regency Landowner, Seducer and Secret Diarist Also, what did she do during the day? This redoubled attention towards Isabella showed itself in Anne getting up at 5:30 to see to the horses in the stable. From seven to nine, she studied Greek and French, from nine to ten overseeing work on the estate. Isabella joined her at ten for breakfast. Between eleven and two, Anne kept an eye on the workers again and then went for a walk with Isabella. They sat down to dinner with Anne’s aunt and uncle at half-past four. After that, Anne took care of her correspondence before they all met up again for coffee at eight. At ten o’clock, Anne was the first to retire, writing her journal before going to bed.Steidele Angela — Gentleman Jack: A biography of Anne Lister, Regency Landowner, Seducer and Secret Diarist And some useful tips from the diaries about time management is “Thanks to her marked need to measure the time, many of her days can be reconstructed down to fifteen-minute intervals.” At last, what does her diary covered? Obviously, there are many ‘kisses’ and many travelogs since she has so many lovers and have been to so many places. However, according to the biography that “It was always about three taboo subjects: sex, money and clothes.” and “Her daily notes on the weather, including exact temperatures, could be used to draw up climate graphs for Yorkshire.”. Her travelsSeeing the well-known places even nowadays that she had been at her time in the map, the admiration of her courageous naturally from my heart. I quite understand her unwillingness of coming back home when they were in Russia. As a role of the husband in their relationship, she is afraid of losing Ann like losing her many lovers again and facing all the pressure and responsibilities from mental and physical. In 1839, she is already 48 years old and her aunt who she can talk to has already died in 1836. Neither politics nor business life, neither her studies nor love had brought her success, happiness or satisfaction. To evade the realisation that she had failed at everything she set her hand to, she took flight one last time: “My love of travel is as great as ever.”Steidele Angela — Gentleman Jack: A biography of Anne Lister, Regency Landowner, Seducer and Secret Diarist I think although it is Isabella who influences Anne to travel abroad and to explore the world, however, it is her great aunt Anne senior and her great wife Ann Walker that companied her to those places, especially Ann. The top 3 among her many travels are: 1840, “From Moscow to the Caucasus”, with Ann Walker This is the toughest and the most exciting trip in her life though ended as a tragic 1830, “Crossed the border between France and Spain at Bosost”, alone Quite interesting to see her intend to cross the border 1822, “Llangollen, the home of Lady Eleanor Butler and Miss Sarah Ponsonby”, with Anne senior A tour of self-awareness Ann WalkerThe tears just come out of my eyes when I read about what Ann Walker suffered and her death at the end of the book. And most of my furious about Anne is from what she has done to her wife, who deserves to be remembered as the same as Anne. If you are convenient, you can help to fund Ann Walker Memorial to establish a new memorial in her honour. Ann Walker proved just as brave as Anne Lister by moving in with her and sitting in the front pew with her at church. Despite anonymous marriage announcements ridiculing Captain Tom Lister and Ann Walker, the two women laid the foundation stone for the Northgate Hotel together, clearly a couple – an emancipatory milestone in the history of women loving women.Steidele Angela — Gentleman Jack: A biography of Anne Lister, Regency Landowner, Seducer and Secret Diarist Although “Ann Walker’s parental home no longer exists; its grounds have been converted to a golf course.” and “Only the old estate wall remains from the days when Anne Lister was such a frequent visitor.”, from the map below, you can easily tell in geography that they are just at a short distance of 3km. Like I said earlier in this post, it is Ann Walker who companied her been to many places. ResourcesPublicationsThesis Rowanchild, Anira. My mind on paper: Anne Lister and literary self-construction in early-nineteenth-century Halifax. Diss. Open University, 1999.: highly recommend reading the part of the appendix, where you can find more about her, including people around her, her chronology and the amazing codebook etc.. Books Sally Wainwright, Anne Choma: Gentleman Jack: The Real Anne Lister The Official Companion to the BBC Series, 2019 Angela Steidele: Gentleman Jack: A biography of Anne Lister, Regency Landowner, Seducer and Secret Diarist, 2018 Patricia L. Hughes: The Early Life of Miss Anne Lister and the Curious Tale of Miss Eliza Raine, 2015 Anne Lister, Helena Whitbread: The Secret Diaries of Miss Anne Lister, 2012 Miscs Website: annelister.co.uk hosted by Helena Whitbread BBC documentary: Revealing Anne Lister Twitter follow list Ann Walker Memorial Shibden Hall Reviews the secret diaries of miss anne lister: thoughts &amp; review Lynn Robertson’s review Ann Walker Find a grave: Ann Walker Ann Walker(20th May 1803 – 25th February 1854) and the Walker family Ann Walker From ‘Gentleman Jack’ Was A Real Person Who Became A Huge Part Of Anne Lister’s Life Gentleman Jack Related The soundtrack at Spotify: Gentleman Jack HBO Soundtrack ‘Gentleman Jack’ Creator Sally Wainwright Interview: On The Fascinating Life Of Anne Lister, Lesbian Trailblazer. 7 Entries From Anne Lister’s Diary That Were Key to Writing Gentleman Jack Further Reading The Adventures of Anne Lister in Scotland 【1822】 Anne Lister’s diary, tour of North Wales 11-27 July 1822 Rebecca Woods “The Life and Loves of Anne Lister” West Yorkshire Archive Service online exhibition on Lister’s diaries. The EndIn my limited reading experiences, this is the first time I read about nonfiction that related to the LGBT+ group. I have gained much more than I have said in this post. From my reading logs, it costs me nearly one month to finish reading the book and 3 days to cover this post. All in all, I hope it will be helpful to those who come across this post. Changelog 2019/07/09：First edition 2019/07/12：Fix typos","categories":[{"name":"Reading","slug":"Reading","permalink":"https://cvblogs.cn/categories/Reading/"}],"tags":[{"name":"Book Review","slug":"Book-Review","permalink":"https://cvblogs.cn/tags/Book-Review/"}]},{"title":"After Reading Wuthering Heights","slug":"reading/review-wuthering-heights-emily-bronte","date":"2019-06-15T13:05:21.000Z","updated":"2019-06-23T15:42:50.000Z","comments":true,"path":"reading/review-wuthering-heights-emily-bronte/","link":"","permalink":"https://cvblogs.cn/reading/review-wuthering-heights-emily-bronte/","excerpt":"Intro “May she wake in torment!” he cried, with frightful vehemence, stamping his foot, and groaning in a sudden paroxysm of ungovernable passion. “Why, she’s a liar to the end! Where is she? Not there—not in heaven—not perished—where? Oh! you said you cared nothing for my sufferings! And I pray one prayer—I repeat it till my tongue stiffens—Catherine Earnshaw, may you not rest as long as I am living; you said I killed you—haunt me, then! The murdered do haunt their murderers, I believe-I know that ghosts have wandered on earth. Be with me always—take any form—drive me mad! only do not leave me in this abyss, where I cannot find you! Oh, God! it is unutterable! I cannot live without my life! I cannot live without my soul!”Emily Brontë — Wuthering Heights chapter 16, page 161-162","text":"Intro “May she wake in torment!” he cried, with frightful vehemence, stamping his foot, and groaning in a sudden paroxysm of ungovernable passion. “Why, she’s a liar to the end! Where is she? Not there—not in heaven—not perished—where? Oh! you said you cared nothing for my sufferings! And I pray one prayer—I repeat it till my tongue stiffens—Catherine Earnshaw, may you not rest as long as I am living; you said I killed you—haunt me, then! The murdered do haunt their murderers, I believe-I know that ghosts have wandered on earth. Be with me always—take any form—drive me mad! only do not leave me in this abyss, where I cannot find you! Oh, God! it is unutterable! I cannot live without my life! I cannot live without my soul!”Emily Brontë — Wuthering Heights chapter 16, page 161-162 MainReason for likeWriting TechniquesI think what makes this novel became so extraordinary for me is its way of constructing the storytelling. The point of view is set at the third person narration and the timeline is range from the past to the moment. Reading the novel is like revealing a rumour or gossip together with Lockwood via Ellen Dean’s narrative. That’s quite a novel way to arrange the plots and that intrigues me to continue reading. Successful characterizationThe story is quite ordinary due to its unavoidable love story mechanism that you can easily infer the plots just with a glance of the genealogy of the novel. The two intruders, mainly Heathcliff destabilized the relationship between the two families. The conflicts in the novel are mainly between Heathcliff and the other characters. Each time the explosion of his stormy emotions, which covered under his aloof appearances, pushes the novel to its climax. His earnest of love and craziness of revenge are the most fascinating parts of the novel. In the afterword of the novel, Juliet Barker commented that ‘Wuthering Heights is a story about passion, possession and revenge’ which I cannot agree more. Quarrel about loveIn chapter 9, Catherine and Ellen Dean have a quarrel about love. I think this plot is quite classic and highly recommend to read. Here is a quote from Catherine. She knew that she will regret marrying Linton afterwards but she did it because she also knew that unites with Heathcliff is her degradation at the time. I think this is the conflict in her mind that the author wants to show the readers and makes us reflect. Here is a classic excerpt from the book about the metaphor of her love for Linton and Heathcliff. My love for Linton is like the foliage in the woods: time will change it, I’m well aware, as winter changes the trees. My love for Heathcliff resembles the eternal rocks beneath: a source of little visible delight, but necessary.Emily Brontë — Wuthering Heights chap 9, page 80 Reasons for dislikeThough many people will consider Joseph as another successful character. But it is a horrible nightmare to readers like me that every time when Joseph showed up talked with his indistinguishable dialect-speaking words. I can barely understand a single word. Due to its social limitations at the time, another reason for dislike, from a modern perspective, could be that it underestimated women. Though there is a character Ellen Dean who is more rational at the opposite of Catherine and Cathy, after reading the novel it strongly tends to leave an idea in the readers’ mind that women are very emotional while always have blindness in love and they need to depend on men to live. I think this is vulgar and stupid masculism in whatever scale causes. And that is why the convention concepts about women are not easy to break down nowadays, e.g., at the old times, the imperial examination system implies that women cannot have knowledge about literature; while nowadays there is another rigid stereotype of women cannot be good at science or engineering and our society encourages women major in liberal arts now. One doubtOne thing confused me the most when I read from chapter 15 to 16 is that Catherine was kind of suddenly pregnant and died. At chapter 15, it ends with Linton’s return from the church while almost found the secret between Catherine and Heathcliff. And suddenly at chapter 16, she died of dystocia after she gave birth of little Cathy. This plot seems unreasonable and so suddenly turned. After searching from the internet, the answer is a little bit clear that in chapter 13, there once mentioned about the heir thing by Ellen Dean. Ah, I thought myself, she might recover, so waited on as she was. and there was double cause to desire it, for on her existence depended that of another; we cherished the hope that in a little while, Mr. Linton’s heart would be gladdened, and his lands secured from a stranger’s gripe, by the birth of an heir.Emily Brontë — Wuthering Heights chapter 13, page 131 ConclusionFor the novel, I always had a blurred mind about I’ve read the novel before. But after I finally began to read, I found myself totally misremembered it with some other books, e.g., The Three Musketeers etc.. Though they have no common plots, it is wired that the thought of ‘have read it’ just stick in my mind and I cannot get rid of it. Not until recently, I took my mind to read it again by coincidence since the Taobao shop which I visit often, behold the stock of the book and the coupon I have in hand is reaching its expiry date. In the 1st day of June, the book finally came to my hand. But with a shortage of words, it was quite hard for me to barely read the novel. There were dozens of new words I’ve never met before and I put it aside for a few days with a thought that it will be shelved since then. Well, thanks to the audio book which first recorded by LibriVox and secondly edited by the user 小宗英语, which sum up to nearly 12 hours long in bilibili.com. I could finally sort of ‘read’ the novel and at least finish it in the end. And it is worth mentioning that another difficulty of reading the novel is, due to the lack of memorizing the names of the characters since the main characters from the novel have a mixed relationship in between. So I highly recommend you should first to make clear of the genealogy of the main characters. Here I attach the genealogy of the novel in the Genealogy section and with some other helpful and related links in the Links section. Checkout and you may need them before you start to read the novel. In the 20th day of June, I finished reading the novel. Felt quite contented and relieved after reading it. And during the time I read the novel, I happened to watch the HBO series called Gentleman Jack and it turned out that the series is adapted from nonfiction historical diaries which written by a woman, contemporary with the Brontë, named Anne Lister, who just lived around York, 14 kilometres near them. What a coincidence. That intrigues me to want to know more about the literature at the time, especially the works of literature about Anne. This review takes me almost 3 to 4 days to finish it, though it still not good enough at least I tried. Hopefully, it will be useful to others who are reading this post. ResourcesGenealogyFrom the genealogy, you could easily distinguish the characters and how the story is constructed above it. The two intruders, mainly Heathcliff, are like a stone falling into the peace water, promotes the development of the plots of the novel. Links Audio Book Link wuthering-heights.co.uk","categories":[{"name":"Reading","slug":"Reading","permalink":"https://cvblogs.cn/categories/Reading/"}],"tags":[{"name":"Book Review","slug":"Book-Review","permalink":"https://cvblogs.cn/tags/Book-Review/"}]},{"title":"After Reading Wonder","slug":"reading/review_wonder_r_j_palacio","date":"2019-04-10T16:40:11.000Z","updated":"2019-04-18T16:12:12.000Z","comments":true,"path":"reading/review_wonder_r_j_palacio/","link":"","permalink":"https://cvblogs.cn/reading/review_wonder_r_j_palacio/","excerpt":"IntroFunny how sometimes you worry a lot about something and it turns out to be nothing. R·J·PalacioWonder","text":"IntroFunny how sometimes you worry a lot about something and it turns out to be nothing. R·J·PalacioWonder MainWhen I was little, there was a strange thought in my mind that scar is a cool thing to make kids look cooler. Thus, I was desperate to have a scar on my body, like, on my arm or leg that others can notice and ask how do I get this. But the scar should definitely not on my face. Then, I could brag it or differentiate from others with the scar. It is a weird thought I should admit now and it is lucky for me that this thought never comes into reality. Especially after reading “Wonder”, I am suspect that whether I have the courage to live with the scars that Auggie has. In the book, it is cruelty that little Auggie has a terrible facial abnormality, which has resulted in him having 27 surgeries. He doesn’t choose the scars but the scars choose him. Thus, he was too cool to be accepted by the people who only meet him for the first time or don’t know him deeply. It is common for me that there are several abnormity kids in my school but never has a kid like Auggie ever appear in my life. And when I was reading the book, I always assumed that if I was there, whether I would perform well or behave well when I met Auggie for the first time. And I think the answer is absolutely CAN’T. Frankly speaking, as I mentioned before, I have never met a kid like that, so even I am a nice person, I think it is still hard for me to not be shocked at the first sight. But I promise the soon after, I will get used to it. The book has been trumpeted as “a book that made grown men weep” and I admit it that I can’t help it several times during reading it and watching the corresponding movie, especially the movie, the actors are so good at performing the story. And the reason is it always make you draw back to the old times at school that have you did well to others or make you reveal some memories at the time. Back to the novel, I think the words the author used are plain but very touching. You will have a good experience during reading it, sometimes sadness sometimes happiness floats you up and down. ConclusionThe book also teaches me one important thing is that do not care too much about others’ words, just live your own colourful life. And also, BE KIND TO OTHERS. Unfortunately, I still suck at writing, I know the words are in my mind but I just can’t figure it out. Here I attach a really good review of this book in the Links section. Hopefully, it will declare my thoughts clearly. Links Wonder by R.J Palacio: a review Changelog 2019/06/23：Fix some typos via Grammarly and don’t change the update time due to its irrelevance to the content","categories":[{"name":"Reading","slug":"Reading","permalink":"https://cvblogs.cn/categories/Reading/"}],"tags":[{"name":"Book Review","slug":"Book-Review","permalink":"https://cvblogs.cn/tags/Book-Review/"}]},{"title":"After Reading 84,Charing Cross Road","slug":"reading/review_84_charing_cross_road_helena_hanff","date":"2019-04-10T12:40:11.000Z","updated":"2019-04-16T16:12:12.000Z","comments":true,"path":"reading/review_84_charing_cross_road_helena_hanff/","link":"","permalink":"https://cvblogs.cn/reading/review_84_charing_cross_road_helena_hanff/","excerpt":"IntroI love inscriptions on flyleaves and notes in margins, I like the comradely sense of turning pages someone else turned, and reading passages some one long gone has called my attention to. Helena·Hanff84 Charing Cross Road","text":"IntroI love inscriptions on flyleaves and notes in margins, I like the comradely sense of turning pages someone else turned, and reading passages some one long gone has called my attention to. Helena·Hanff84 Charing Cross Road MainThere are four aspects I want to mention after reading the book. First of all, I need to admit that the book is quite easy to read. Though you may get lost in some contents, or some letters exactly if you lack some backgrounds of common literature knowledge. But you will still have an enjoyable reading experience from it, letters by letters, words by words. Secondly, I may category the book as documentary genre because all the contents are from the correspondence between a woman, the writer of the book, also a book buyer and a reader in America, and some staff, mainly a bookseller named Frank, in a book store, locates the title of the book, in England. There are many virtuals of mankind conveyed from the book or the whole story. After reading it, a happy feeling about friendship or some other feelings will rise from your heart. More than that, different people may have different points of view of the book. For me, the truth hidden in the story is the most fascinating thing. After reading it, I am eager to know more about the history at that time, especially age 1950’s. As for me, I find that I have shallow knowledge about the history of Europe or England precisely. And it is always blurred in my mind that the western countries or the people in there live a better life than the people in my motherland in early modern times. I am shocked that the ordinary people there have the same bitter lives as well. For example, I never imagine that they once experienced a rationing system. No wonder, that may be why George Orwell wrote 1984? On the other hand, I also knew that though having learned English as a second language for so many years, I am still illiteracy in the spoken countries if I didn’t have the basis of common literature knowledge there. Last but not least, I want to take a reflection of the development of human society nowadays. It is so speedy that it may be lost in its mind. We should keep our mind clear and always steer in the right direction. Maybe it is time to slow our pace and look around. ConclusionFirst book review in English. Talk about the experience of reading the book, some descriptions of the contents, the most fascinating thing of the book and some reflections after reading it. Still, need more practice in writing. In the end, I attach the link of 84charingcrossroad.co.uk, which is a good place to know more about the store, in reality, seems the whole story is real. Links 84charingcrossroad.co.uk Changelog 2019/06/23：Fix some typos via Grammarly and don’t change the update time due to its irrelevance to the content","categories":[{"name":"Reading","slug":"Reading","permalink":"https://cvblogs.cn/categories/Reading/"}],"tags":[{"name":"Book Review","slug":"Book-Review","permalink":"https://cvblogs.cn/tags/Book-Review/"}]}],"categories":[{"name":"Programming","slug":"Programming","permalink":"https://cvblogs.cn/categories/Programming/"},{"name":"Reading","slug":"Reading","permalink":"https://cvblogs.cn/categories/Reading/"}],"tags":[{"name":"System Design","slug":"System-Design","permalink":"https://cvblogs.cn/tags/System-Design/"},{"name":"Book Review","slug":"Book-Review","permalink":"https://cvblogs.cn/tags/Book-Review/"}]}